# Carga de archivos a zona bronce

## Configuración

In [29]:
#importaciones y configuraciones

from sqlalchemy import create_engine
import pandas as pd

POSTGRES_CONN_STRING = "postgresql://postgres:123456@127.0.0.1:5432/postgres"
CSV_PATH = "/Users/fsalazars/Documents/Proyectos/globant/prueba tecnica/desarrollo/data/"

version = 1

In [30]:
engine = create_engine(POSTGRES_CONN_STRING)

## Carga tabla jobs

In [31]:
# Leer el archivo CSV en Pandas
df_jobs = pd.read_csv(CSV_PATH+'jobs.csv', names=['id', 'job'])

In [32]:
df_jobs

      id                          job
0      1          Marketing Assistant
1      2                     VP Sales
2      3           Biostatistician IV
3      4    Account Representative II
4      5                 VP Marketing
..   ...                          ...
178  179         Software Engineer II
179  180              Statistician IV
180  181         Programmer Analyst I
181  182     Account Representative I
182  183  Administrative Assistant IV

[183 rows x 2 columns]

In [33]:
df_jobs.to_sql(name='jobs',
               schema='bronze',
               con=engine, 
               if_exists='replace', 
               index=False)

183

## Carga tabla departments

In [34]:
# Leer el archivo CSV en Pandas
df_departments = pd.read_csv(CSV_PATH+'departments.csv', names=['id', 'department'])

In [35]:
df_departments

    id                department
0    1        Product Management
1    2                     Sales
2    3  Research and Development
3    4      Business Development
4    5               Engineering
5    6           Human Resources
6    7                  Services
7    8                   Support
8    9                 Marketing
9   10                  Training
10  11                     Legal
11  12                Accounting

In [36]:
df_departments.to_sql(name='departments',
                      schema='bronze',
                      con=engine, 
                      if_exists='replace', 
                      index=False)

12

## Carga tabla Empleados

In [37]:
df_empleados = pd.read_csv(CSV_PATH+'hired_employees.csv', names=['id', 'name', 'datetime','department_id', 'job_id'])

In [38]:
df_empleados

        id                name              datetime  department_id  job_id
0        1         Harold Vogt  2021-11-07T02:48:42Z            2.0    96.0
1        2            Ty Hofer  2021-05-30T05:43:46Z            8.0     NaN
2        3         Lyman Hadye  2021-09-01T23:27:38Z            5.0    52.0
3        4       Lotti Crowthe  2021-10-01T13:04:21Z           12.0    71.0
4        5      Gretna Lording  2021-10-10T22:22:17Z            6.0    80.0
...    ...                 ...                   ...            ...     ...
1994  1995          Goran Yong  2021-08-22T21:57:53Z            2.0    83.0
1995  1996  Cirstoforo Youings  2021-04-01T17:48:42Z            3.0    23.0
1996  1997     Wilek Yurkevich  2021-05-04T12:19:50Z            2.0   132.0
1997  1998          Jerry Yven  2021-10-03T14:12:50Z            7.0   100.0
1998  1999       Jerri Zebedee  2022-01-18T10:47:37Z            8.0    80.0

[1999 rows x 5 columns]

In [39]:
df_empleados.to_sql(name='hired_employees',
                    schema='bronze',
                    con=engine, 
                    if_exists='replace', 
                    index=False)

999